/**
 *****************************************************************************************************************************************************************************
 * 
 * @author :fengguangjing
 * @createTime:2017-8-16上午11:01:45
 * @version:4.2.4
 * @modifyTime:
 * @modifyAuthor:
 * @description:
 *****************************************************************************************************************************************************************************
 */
package com.open.mmxzg.presenter;

import com.open.android.mvp.presenter.CommonPresenter;

/**
 *****************************************************************************************************************************************************************************
 * 
 * @author :fengguangjing
 * @createTime:2017-8-16上午11:01:45
 * @version:4.2.4
 * @modifyTime:
 * @modifyAuthor:
 * @description:
 *****************************************************************************************************************************************************************************
 */
public interface MImagePagerAdapterPresenter extends CommonPresenter {

	/**
	 * 设置位置
	 */
	void setPosition(int position);
	
	/**
	 * pagesize》0；list有数据。传值url
	 */
	void setUrl(String url);
	
	/**
	 * url
	 */
	String getUrl();
}
